---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient1Wall
source: html/f50dce83-170b-32f3-88f4-5a6a45f5a957.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient1Wall Property

"Primary Bar - End Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinEndHookOrient1Wall { get; }
```